//ACCJCL   JOB NOTIFY=&SYSUID,CLASS=A,MSGCLASS=A,PRTY=15
//*--------------------------------------------------------------------*
//*   << PRE-DEFINED COBOL COMPILE PRODECRE - IGYWCL/IGYWCLG >>        *
//*--------------------------------------------------------------------*
//COMPILE  EXEC IGYWCL,SRC=BNKACC
//SYSIN    DD DSNAME=&SYSUID..CBL.SAMPLE(&SRC),DISP=SHR
//*--------------------------------------------------------------------*
//*   << STEP LIBRARY - LOAD MODULE >>                                 *
//*--------------------------------------------------------------------*
//RUN      EXEC PGM=BNKACC
//STEPLIB  DD DSN=&SYSUID.LOAD,DISP=SHR
//*--------------------------------------------------------------------*
//*   << INPUT FILES >>                                                *
//*--------------------------------------------------------------------*
//BALFILE  DD DSN=&SYSUID.SOURCE.ACCOUNT,DISP=SHR
//DEPFILE  DD DSN=&SYSUID.SOURCE.DEPOSIT,DISP=SHR
//WITFILE  DD DSN=&SYSUID.SOURCE.WITHDRW,DISP=SHR
//*--------------------------------------------------------------------*
//*   << OUTPUT FILE >>                                                *
//*--------------------------------------------------------------------*
//OUTFILE  DD DSN=&SYSUID.SOURCE.OUTPUT,DISP=MOD
//*--------------------------------------------------------------------*
//*   << SPOOL OUTPUT >>                                               *
//*--------------------------------------------------------------------*
//SYSOUT   DD SYSOUT=*
