//STKJCL   JOB NOTIFY=&SYSUID,CLASS=A,MSGCLASS=A,PRTY=15
//*--------------------------------------------------------------------*
//*   << PRE-DEFINED COBOL COMPILE PRODECRE - IGYWCL/IGYWCLG >>        *
//*--------------------------------------------------------------------*
//COMPILE  EXEC IGYWCL,SRC=STKCBL
//SYSIN    DD DSNAME=&SYSUID..CBL.SAMPLE(&SRC),DISP=SHR
//*--------------------------------------------------------------------*
//*   << STEP LIBRARY - LOAD MODULE >>                                 *
//*--------------------------------------------------------------------*
//RUN      EXEC PGM=STKCBL
//STEPLIB  DD DSN=&SYSUID.LOAD,DISP=SHR
//*--------------------------------------------------------------------*
//*   << INPUT FILE  >>                                                *
//*--------------------------------------------------------------------*
//INFILE   DD DSN=&SYSUID.STOCKS.ACCOUNT,DISP=SHR
//*--------------------------------------------------------------------*
//*   << OUTPUT FILE >>                                                *
//*--------------------------------------------------------------------*
//OUTFILE  DD DSN=&SYSUID.STOCKS.OUTPUT,DISP=OLD
//*--------------------------------------------------------------------*
//*   << SPOOL OUTPUT >>                                               *
//*--------------------------------------------------------------------*
//SYSOUT   DD SYSOUT=*
