       01  BODY.
           05 VAL0                        PIC  X(10).
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL1                        PIC  X(46).
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL2                        PIC  X(11).
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL3                        PIC  X(46).
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL4                        PIC ZZZZ,ZZZ,ZZ9.
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL5                        PIC ZZZZ,ZZZ,ZZ9.
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL6                        PIC ZZZZ,ZZZ,ZZ9.
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL7                        PIC ZZZZ,ZZZ,ZZ9.
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL8                        PIC ZZZZ,ZZZ,ZZ9.
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL9                        PIC ZZZZ,ZZZ,ZZ9.
           05 FILLER                      PIC  X(14) VALUE SPACE.
