       01  HEADER1.
           05 COL0                        PIC X(10)
                          VALUE 'DATE      '.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL1                        PIC X(46)
                          VALUE 'COUNTRY                       '.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL2                        PIC X(11)
                          VALUE 'COUNTRYCODE'.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL3                        PIC X(46)
                          VALUE 'SLUG                          '.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL4                        PIC X(12)
                          VALUE 'NEWCONFIRMED'.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL5                        PIC X(14)
                          VALUE 'TOTALCONFIRMED'.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL6                        PIC X(09)
                          VALUE 'NEWDEATHS'.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL7                        PIC X(11)
                          VALUE 'TOTALDEATHS'.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL8                        PIC X(12)
                          VALUE 'NEWRECOVERED'.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL9                        PIC X(14)
                          VALUE 'TOTALRECOVERED'.
           05 FILLER                      PIC X(14) VALUE SPACE.
       01  HEADER0.
           05 COL0                        PIC X(10)
                          VALUE '****      '.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL1                        PIC X(46)
                          VALUE '*******                       '.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL2                        PIC X(11)
                          VALUE '***********'.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL3                        PIC X(46)
                          VALUE '****                          '.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL4                        PIC X(12)
                          VALUE '************'.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL5                        PIC X(14)
                          VALUE '**************'.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL6                        PIC X(09)
                          VALUE '*********'.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL7                        PIC X(11)
                          VALUE '***********'.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL8                        PIC X(12)
                          VALUE '************'.
           05 FILLER                      PIC X(01) VALUE SPACE.
           05 COL9                        PIC X(14)
                          VALUE '**************'.
           05 FILLER                      PIC X(14) VALUE SPACE.
