       01  BODY.
           05 VAL0                        PIC  X(10).
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL1                        PIC  X(46).
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL2                        PIC  X(11).
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL3                        PIC  X(46).
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL4                        PIC ZZZZZZZZZZZ9.
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL5                        PIC ZZZZZZZZZZZZZ9.
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL6                        PIC ZZZZZZZZ9.
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL7                        PIC ZZZZZZZZZZ9.
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL8                        PIC ZZZZZZZZZZZ9.
           05 FILLER                      PIC  X(01) VALUE SPACE.
           05 VAL9                        PIC ZZZZZZZZZZZZZ9.
           05 FILLER                      PIC  X(14) VALUE SPACE.