//COVIDJCL JOB NOTIFY=&SYSUID,CLASS=A,MSGCLASS=A,PRTY=15
//*--------------------------------------------------------------------*
//*   << PRE-DEFINED COBOL COMPILE PRODECRE - IGYWCL/IGYWCLG >>        *
//*--------------------------------------------------------------------*
//COMPILE  EXEC IGYWCL,SRC=COVIDCBL
//SYSIN    DD DSNAME=&SYSUID..CBL.SAMPLE(&SRC),DISP=SHR
//SYSLIB   DD DSN=&SYSUID..SAMPLE.COBCOPY,DISP=SHR
//*--------------------------------------------------------------------*
//*   << STEP LIBRARY - LOAD MODULE >>                                 *
//*--------------------------------------------------------------------*
// IF RC = 0 THEN
//*--------------------------------------------------------------------*
//RUN      EXEC PGM=COVIDCBL
//STEPLIB  DD DSN=Z80076.LOAD,DISP=SHR
//*--------------------------------------------------------------------*
//*   << INPUT FILE  >>                                                *
//*--------------------------------------------------------------------*
//INFILE   DD DSN=Z80076.COVID.COUNTRY,DISP=SHR
//*--------------------------------------------------------------------*
//*   << OUTPUT FILE >>                                                *
//*--------------------------------------------------------------------*
//OUTFILE  DD DSN=Z80076.COVID.OUTPUT,DISP=OLD
//*--------------------------------------------------------------------*
//*   << SPOOL OUTPUT >>                                               *
//*--------------------------------------------------------------------*
//SYSOUT   DD SYSOUT=*
//*--------------------------------------------------------------------*
// ELSE
// ENDIF
//*--------------------------------------------------------------------*
//STEP01   EXEC PGM=SORT
//SORTIN   DD DSN=Z80076.COVID.OUTPUT,DISP=SHR
//SORTOUT  DD DSN=Z80076.COVID.OUTPUT.SORTED,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSIN DD *
   SORT FIELDS=(156,11,ZD,D)
/*
